In [85]:
import pandas as pd

data = pd.read_csv('adult.data.csv')

data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [86]:
race_count = data.value_counts('race')

race_count

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
dtype: int64

In [87]:
race_count['Black']

3124

In [88]:
avg_age_m = data[data['sex']=='Male']['age'].mean()

avg_age_m = round(avg_age_m,1)
avg_age_m

39.4

In [89]:
avg_age_m = round(data[data['sex']=='Male']['age'].mean(),1)
avg_age_m

39.4

In [90]:
ed_percent = round(data['education'].value_counts(normalize=True) * 100,1)
bachlors = ed_percent['Bachelors']

ed_percent

HS-grad         32.3
Some-college    22.4
Bachelors       16.4
Masters          5.3
Assoc-voc        4.2
11th             3.6
Assoc-acdm       3.3
10th             2.9
7th-8th          2.0
Prof-school      1.8
9th              1.6
12th             1.3
Doctorate        1.3
5th-6th          1.0
1st-4th          0.5
Preschool        0.2
Name: education, dtype: float64

In [91]:
adv_degree = ['Bachelors','Masters','Doctorate']

perc_adv_degree = round(ed_percent[adv_degree].sum(),1)

perc_adv_degree

23.0

In [92]:
perc_no_adv_degree = 100 - perc_adv_degree
perc_no_adv_degree

77.0

In [93]:
adv_degree = ['Bachelors','Masters','Doctorate']
data['higher_ed'] = data['education'].isin(adv_degree)
pd.crosstab(data['higher_ed'],data['salary'])

salary     <=50K  >50K
higher_ed
False      20715  4355
True        4005  3486

In [94]:
adv_degree = ['Bachelors','Masters','Doctorate']
data['higher_ed'] = data['education'].isin(adv_degree)
sal_ed_t = pd.crosstab(data['higher_ed'],data['salary'],normalize='index')*100
sal_ed_t

salary         <=50K       >50K
higher_ed
False      82.628640  17.371360
True       53.464157  46.535843

In [95]:
round(sal_ed_t.loc[True,'>50K'],1)

46.5

In [96]:
round(sal_ed_t.loc[False,'>50K'],1)

17.4

In [97]:
data['min_hr_worked'] = data['hours-per-week']==1
min_hrs_salary_table = pd.crosstab(data['min_hr_worked'],data['salary'],normalize='index')
min_hrs_salary_table

salary            <=50K      >50K
min_hr_worked
False          0.759104  0.240896
True           0.900000  0.100000

In [98]:
min_hrs_wealthy = min_hrs_salary_table.loc[True,'>50K']
min_hrs_wealthy

0.1

In [99]:
hr_per_week = data['hours-per-week'].value_counts().sort_index()
hr_per_week.iloc[0]

20

In [100]:
min_weekly_hours = min(data['hours-per-week'])

min_weekly_hours

1

In [141]:
# What country has the highest percentage of people that earn >50k

inc_by_country = pd.crosstab(data['native-country'],data['salary'])
inc_by_country['perc_over_50k'] = inc_by_country['>50K'] / (inc_by_country['>50K'] + inc_by_country['<=50K'])
sorted_inc_by_country = inc_by_country.sort_values(by='perc_over_50k',ascending=False)
top_country = sorted_inc_by_country.index[0]
top_country_percent = round(sorted_inc_by_country['perc_over_50k'][0]*100,1)

In [142]:
top_country_percent

41.9

In [137]:
top_country

'Iran'

In [136]:
sorted_inc_by_country

salary                      <=50K  >50K  perc_over_50k
native-country
Iran                           25    18       0.418605
France                         17    12       0.413793
India                          60    40       0.400000
Taiwan                         31    20       0.392157
Japan                          38    24       0.387097
Yugoslavia                     10     6       0.375000
Cambodia                       12     7       0.368421
Italy                          48    25       0.342466
England                        60    30       0.333333
Canada                         82    39       0.322314
Germany                        93    44       0.321168
Philippines                   137    61       0.308081
Hong                           14     6       0.300000
Greece                         21     8       0.275862
China                          55    20       0.266667
Cuba                           70    25       0.263158
?                             437   146       0.250429
Scotland                        9     3       0.250000
United-States               21999  7171       0.245835
Hungary                        10     3       0.230769
Ireland                        19     5       0.208333
South                          64    16       0.200000
Poland                         48    12       0.200000
Thailand                       15     3       0.166667
Ecuador                        24     4       0.142857
Jamaica                        71    10       0.123457
Laos                           16     2       0.111111
Portugal                       33     4       0.108108
Trinadad&Tobago                17     2       0.105263
Puerto-Rico                   102    12       0.105263
Haiti                          40     4       0.090909
El-Salvador                    97     9       0.084906
Honduras                       12     1       0.076923
Vietnam                        62     5       0.074627
Peru                           29     2       0.064516
Nicaragua                      32     2       0.058824
Mexico                        610    33       0.051322
Guatemala                      61     3       0.046875
Columbia                       57     2       0.033898
Dominican-Republic             68     2       0.028571
Outlying-US(Guam-USVI-etc)     14     0       0.000000
Holand-Netherlands              1     0       0.000000

In [108]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,higher_ed,min_hr_worked
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,True,False
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,True,False
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,False,False
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,False,False
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,True,False

In [109]:
india_50k = (data['native-country'] == 'India') & (data['salary']=='>50K')

india_50k = data[india_50k]

occ_rank = india_50k['occupation'].value_counts(ascending=False)

top_occ = occ_rank.index[0]


occ_rank 

top_occ

'Prof-specialty'